==================
one variable
==================

foo=bar

---

(source_file
  (env_variable 
    (env_key
      (unquoted_string))
      (unquoted_string)))

==================
many variables
==================

foo=bar
bar=foo

---

(source_file
      (env_variable
        (env_key
          (unquoted_string))
        (unquoted_string))
      (env_variable
        (env_key
          (unquoted_string))
        (unquoted_string)))

==================
variables with comments
==================

# Set root to POSTGRES_USER
POSTGRES_USER=root
POSTGRES_URL=postgres://posgres:123456@127.0.0.1:5432/dummy # connection url

---

(source_file
  (comment)
  (env_variable
    (env_key
      (unquoted_string))
    (unquoted_string))
  (env_variable
    (env_key
      (unquoted_string))
    (unquoted_string))
  (comment))


==================
quoted values
==================

foo="bar"
bar='foo'

---

(source_file
      (env_variable
        (env_key
          (unquoted_string))
        (quoted_string))
      (env_variable
        (env_key
          (unquoted_string))
        (unquoted_string)))

==================
variable without value
==================

foo=

---

(source_file
  (env_variable
    (env_key
      (unquoted_string))))

==================
variable with another variable
==================

foo=${bar}:${bar}

---

(source_file
      (env_variable
        (env_key
          (unquoted_string))
        (unquoted_string
          (expansion
            (variable))
          (expansion
            (variable)))))